/* No comment provided by engineer. */
"%.0lfk of %.0lfk" = "%1$.0lfk / %2$.0lfk";

/* No comment provided by engineer. */
"%@ %@ has been installed and will be ready to use next time %@ starts! Would you like to relaunch now?" = "%1$@ %2$@ on asennettu ja on valmiina käyttöön seuraavan kerran kun %3$@ käynnistetään! Haluatko käynnistää ohjelman uudelleen?";

/* No comment provided by engineer. */
"%@ %@ is currently the newest version available." = "%1$@ %2$@ on uusin saatavilla oleva versio.";

/* No comment provided by engineer. */
"%@ %@ is now available (you have %@). Would you like to download it now?" = "%1$@ %2$@ on nyt saatavilla (sinulla on %3$@). Haluatko ladata sen nyt?";

/* No comment provided by engineer. */
"%@ does not have permission to write to the application's directory! Are you running off a disk image? If not, ask your system administrator for help." = "Käyttäjällä %@ ei ole oikeuksia ohjelman kansioon! Ajatko ohjelmaa levytiedostosta? Jos et, kysy apua järjestelmän ylläpitäjältä.";

/* No comment provided by engineer. */
"A new version of %@ has been installed!" = "Uusi versio ohjelmasta %@ on asennettu!";

/* No comment provided by engineer. */
"A new version of %@ is available!" = "Uusi versio ohjelmasta  %@ on saatavilla!";

/* No comment provided by engineer. */
"An error occurred during installation. Please try again later." = "Asennuksen yhteydessä tapahtui virhe. Yritä myöhemmin uudelleen.";

/* No comment provided by engineer. */
"An error occurred in retrieving update information. Please try again later." = "Päivitystietojen haussa tapahtui virhe. Yritä myöhemmin uudelleen.";

/* No comment provided by engineer. */
"An error occurred while extracting the archive. Please try again later." = "Pakkauksen purkamisen yhteydessä tapahtui virhe. Yritä myöhemmin uudelleen.";

/* No comment provided by engineer. */
"An error occurred while trying to download the file. Please try again later." = "Tiedoston latauksessa tapahtui virhe. Yritä myöhemmin uudelleen.";

/* No comment provided by engineer. */
"An error occurred while trying to relaunch %@. The update will take effect next you run %@." = "Ohjelman %1$@ uudelleenkäynnistyksessä tapahtui virhe. Päivitys tehdään kun ajat ohjelman %2$@.";

/* No comment provided by engineer. */
"An update is already in progress!" = "Päivitys on jo menossa!";

/* No comment provided by engineer. */
"Cancel" = "Kumoa";

/* No comment provided by engineer. */
"Check for updates on startup?" = "Tarkista päivityksiä käynnistyksen yhteydessä?";

/* No comment provided by engineer. */
"Downloading update..." = "Lataan päivitystä...";

/* No comment provided by engineer. */
"Extracting update..." = "Puran päivitystä...";

/* No comment provided by engineer. */
"Install and Relaunch" = "Asenna ja käynnistä ohjelma uudelleen";

/* No comment provided by engineer. */
"Installing update..." = "Asennan päivityksen...";

/* No comment provided by engineer. */
"No" = "Ei";

/* No comment provided by engineer. */
"OK" = "OK";

/* No comment provided by engineer. */
"Ready to install!" = "Valmiina asentamaan!";

/* No comment provided by engineer. */
"Update Error!" = "Virhe päivityksessä!";

/* No comment provided by engineer. */
"Updating %@" = "Päivitän %@";

/* No comment provided by engineer. */
"Would you like %@ to check for updates on startup? If not, you can initiate the check manually from the application menu." = "Haluatko tarkistaa päivitykset ohjelmaan %@ käynnistyksen yhteydessä? Jos et, voit käynnnistää tarkistuksen käsin ohjelmavalikosta.";

/* No comment provided by engineer. */
"Yes" = "Kyllä";

/* No comment provided by engineer. */
"You're up to date!" = "Sinulla on viimeisin versio!";

